org/bdd/13_recuperacion.org
#+title:Recuperacion
#+date: <2020-01-30 Thu>

* Introducción

** Fallas

   Los sistemas reales sufren multiples tipos de fallas:
   1. Fallas de sistema: por errores de software o hardware que detienen la
      ejecucion de un programa: fallas de segmentacion, division por cero, fallas
      de memoria.
   2. Fallas de aplicacion: aquellas que provienen desde la aplicacion que utliliza
      la base de datos. Por ejemplo, la cancelacion o vuelta atras de una
      transaccion.
   3. Fallas de dispositivos: aquellas que provienen de un daño fisico en
      dispositivos como discos rigidos o memoria.
   4. Fallas naturales externas: son aquellas que provienen desde afuera del
      hardware en que se ejecuta nuestro SGDB. Ejemplos: caides de tension,
      terremotos, incendios, ...

   En situaciones catastroficas como 3 o 4, es necesario contar con mecanismos
   de backup para recuperar la informacion.

** Introducción

   Comencemos por considerar que se produce una falla no catastrofica en el
   momento en que una transaccion se esta ejecutando

   En algun momento el sistema se reinicia, y la base de datos debera ser
   llevada al estado inmediato anterior al comienzo de la transaccion.

   Para ello, es necesario mantener informacion en el log acerca de los cambios
   que la transaccion fue realizando.

   Para cada instruccion que se ejecuta
   - X \rightarrow Buffer en memoria \rightarrow Disco

   Hasta ahora no hemos hablado de _en que momento un buffer en memoria se
   almacena en disco_. Solo habiamos asumido que si encontramos dos
   instrucciones WT1(X)RT2(X), con toda seguridad T2 va a leer el valor
   modificado por T1.

*** Tecnicas de volcado a disco (flush)

    En los metodos de ~actualización inmediata (immediate update)~, los datos se
    guardan en disco lo antes posible, y necesariamente antes del commit de la
    transaccion.

    En la ~actualización diferida (deferred update)~, los datos se guardan en disco
    despues del commit de la transaccion.

* Gestor de recuperacion

** Estructura del log

   Para hacer posible la recuperacion ante fallas, el ~gestor de recuperacion~ del
   SGDB guarda una serie de informacion en un log (bitacora)

   El log almacena generalmente los sigientes registros:

   ...

   En realidad, segun el algoritmo de recuperacion que utilicemos, no siempre sera
   necesario guardar los valores anteriores y actuales en el WRITE,  no siempre
   sera necesario guardar los READ's.

** Reglas WAL y FLC

   EL gestor de logs se guia por dos reglas basicas
   - ~WAL (Write Ahead Log)~
   - ~FLC (Force Log at Commit)~

   La regla WAL indica que antes de guardar un item modificado en disco, se debe
   escribir el registro de log correspondiente, ~en disco~.

   La regla FLC indica que antes de realizar el commit, el log debe ser volcado a
   disco.

* Algoritmos de recuperacion

** Hipotesis [ELM16 22.1.5] [GM09 19.1.3]

   En los siguientes algoritmos de recuperacion de una base de datos ante fallas,
   se asume que los solapamientos de transacciones son:
   - Recuperables
   - Evitan rollbacks en cascada

   Si esta hipotesis no se cumpliera los algoritmos deberan realizar algunos pasos
   adicionales que no describiremos. En particular, utilizar los registros de
   lectura (READ, T_i, X, v) del log.

** Algoritmo UNDO (Immediate update)
*** Regla
    Todo valor v_{old} asignado por una transacción que ya commiteó debe ser
    salvaguardado en el log en disco antes de que su modificación por parte de
    otra transacción sea guardada en disco (flushed).

*** Procedimiento [GM09 17.2.2]

    Para cumplir con la regla se utiliza el siguiente procedimiento:
    1. Cuando una transacción Ti modifica el ítem X remplazando un valor v_{old}
       por v, se escribe (WRITE,Ti,X,vold) en el log, y se hace flush del log a
       disco.
    2. El registro (WRITE,Ti,X,vold) debe ser escrito en el log en
       disco(flushed) antes de escribir (flush) el nuevo valor de X en disco
       (WAL).
    3. Todo ítem modificado debe ser guardado en disco antes de hacer commit.
    4. Cuando Ti hace commit, se escribe (COMMIT,Ti) en el log y se hace flush
       del log a disco (FLC).

*** Observaciones

    Los tres primeros puntos aseguran que todas las modificaciones realizadas
    sean escritas a disco antes de que la transacción termine.

    De esta forma, una vez cumplimentado el paso 4, ya nunca será necesario
    hacer REDO. Si la transacción falla antes ó durante el punto 4, será
    deshecha (UNDO) al reiniciar.

    Se considera que la transacción commiteó cuando el registro (COMMIT,Ti)
    queda escrito en el log, en disco.

*** Reinicio [GM09 17.2.3]

    Cuando el sistema reinicia se siguen los siguientes pasos:
    1. Se recorre el log de adelante hacia atras, y por cada transaccion de la
       que no se encuentra el COMMIT, se aplica cada uno de los WRITE para
       restaurar el valor anterior a la misma en disco.
    2. Luego, por cada transaccion de la que no se encontro el COMMIT se escribe
       (ABORT, T) en el log y se hace flush del log a disco.

    Observece que tambien podria ocurrir una falla durante el reinicio. Esto no
    es un problema porque el procedimiento de reinicio es ~idempotente~: si se
    ejecuta mas de una vez, no cambiaria el resultado.

*** Ejemplo

    Considere el siguiente solapamiento de transacciones.

    Suponga que los valores iniciales de los ítems son A=60,B=44,C=38.

    | Transacción T1   | Transacción T2   | Transacción T3   |
    | begin            |                  |                  |
    | leer_item(B)     |                  |                  |
    | B=B+4            |                  |                  |
    | escribir_item(B) |                  |                  |
    |                  | begin            |                  |
    |                  | leer_item(A)     |                  |
    |                  | leer_item(C)     |                  |
    |                  | A=A÷2            |                  |
    |                  | C=C+10           |                  |
    |                  | escribir_item(A) |                  |
    |                  | escribir_item(C) |                  |
    |                  |                  | begin            |
    | commit           |                  |                  |
    |                  |                  | leer_item(B)     |
    |                  |                  | B=B+5            |
    |                  |                  | escribir_item(B) |
    |                  | commit           |                  |
    |                  |                  | leer_item(A)     |
    |                  |                  | A=A×1,10         |
    |                  |                  | escribir_item(A) |
    |                  |                  | commit           |

*** Ejercicios

**** 1
     Escriba la secuencia de registros de un log UNDO (omita los registros de
     lectura).

     |  1 | BEGIN T1      |
     |  2 | WRITE T1 B 44 |
     |  3 | BEGIN T2      |
     |  4 | WRITE T2 A 60 |
     |  5 | WRITE T2 C 38 |
     |  6 | BEGIN T3      |
     |  7 | COMMIT T1     |
     |  8 | WRITE T2 B 48 |
     |  9 | COMMIT T2     |
     | 10 | WRITE T3 A 30 |
     | 11 | COMMIT T3     |

