bdd/13_recuperacion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-01 Fri 11:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Recuperacion</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="/home/mk/Documents/blogs/org.css"/>
</head>
<body>
<div id="content">
<div id="outline-container-org75de2eb" class="outline-2">
<h2 id="org75de2eb">Introducción</h2>
<div class="outline-text-2" id="text-org75de2eb">
</div>
<div id="outline-container-org5d1c642" class="outline-3">
<h3 id="org5d1c642">Fallas</h3>
<div class="outline-text-3" id="text-org5d1c642">
<p>
Los sistemas reales sufren multiples tipos de fallas:
</p>
<ol class="org-ol">
<li>Fallas de sistema: por errores de software o hardware que detienen la
ejecucion de un programa: fallas de segmentacion, division por cero, fallas
de memoria.</li>
<li>Fallas de aplicacion: aquellas que provienen desde la aplicacion que utliliza
la base de datos. Por ejemplo, la cancelacion o vuelta atras de una
transaccion.</li>
<li>Fallas de dispositivos: aquellas que provienen de un daño fisico en
dispositivos como discos rigidos o memoria.</li>
<li>Fallas naturales externas: son aquellas que provienen desde afuera del
hardware en que se ejecuta nuestro SGDB. Ejemplos: caides de tension,
terremotos, incendios, &#x2026;</li>
</ol>

<p>
En situaciones catastroficas como 3 o 4, es necesario contar con mecanismos
de backup para recuperar la informacion.
</p>
</div>
</div>

<div id="outline-container-orgec782f7" class="outline-3">
<h3 id="orgec782f7">Introducción</h3>
<div class="outline-text-3" id="text-orgec782f7">
<p>
Comencemos por considerar que se produce una falla no catastrofica en el
momento en que una transaccion se esta ejecutando
</p>

<p>
En algun momento el sistema se reinicia, y la base de datos debera ser
llevada al estado inmediato anterior al comienzo de la transaccion.
</p>

<p>
Para ello, es necesario mantener informacion en el log acerca de los cambios
que la transaccion fue realizando.
</p>

<p>
Para cada instruccion que se ejecuta
</p>
<ul class="org-ul">
<li>X &rarr; Buffer en memoria &rarr; Disco</li>
</ul>

<p>
Hasta ahora no hemos hablado de <span class="underline">en que momento un buffer en memoria se
almacena en disco</span>. Solo habiamos asumido que si encontramos dos
instrucciones WT1(X)RT2(X), con toda seguridad T2 va a leer el valor
modificado por T1.
</p>
</div>

<div id="outline-container-org4656f5d" class="outline-4">
<h4 id="org4656f5d">Tecnicas de volcado a disco (flush)</h4>
<div class="outline-text-4" id="text-org4656f5d">
<p>
En los metodos de <code>actualización inmediata (immediate update)</code>, los datos se
guardan en disco lo antes posible, y necesariamente antes del commit de la
transaccion.
</p>

<p>
En la <code>actualización diferida (deferred update)</code>, los datos se guardan en disco
despues del commit de la transaccion.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org6924afb" class="outline-2">
<h2 id="org6924afb">Gestor de recuperacion</h2>
<div class="outline-text-2" id="text-org6924afb">
</div>
<div id="outline-container-org13af27f" class="outline-3">
<h3 id="org13af27f">Estructura del log</h3>
<div class="outline-text-3" id="text-org13af27f">
<p>
Para hacer posible la recuperacion ante fallas, el <code>gestor de recuperacion</code> del
SGDB guarda una serie de informacion en un log (bitacora)
</p>

<p>
El log almacena generalmente los sigientes registros:
</p>

<p>
&#x2026;
</p>

<p>
En realidad, segun el algoritmo de recuperacion que utilicemos, no siempre sera
necesario guardar los valores anteriores y actuales en el WRITE,  no siempre
sera necesario guardar los READ's.
</p>
</div>
</div>

<div id="outline-container-org003b3c9" class="outline-3">
<h3 id="org003b3c9">Reglas WAL y FLC</h3>
<div class="outline-text-3" id="text-org003b3c9">
<p>
EL gestor de logs se guia por dos reglas basicas
</p>
<ul class="org-ul">
<li><code>WAL (Write Ahead Log)</code></li>
<li><code>FLC (Force Log at Commit)</code></li>
</ul>

<p>
La regla WAL indica que antes de guardar un item modificado en disco, se debe
escribir el registro de log correspondiente, <code>en disco</code>.
</p>

<p>
La regla FLC indica que antes de realizar el commit, el log debe ser volcado a
disco.
</p>
</div>
</div>
</div>

<div id="outline-container-org1f3faf2" class="outline-2">
<h2 id="org1f3faf2">Algoritmos de recuperacion</h2>
<div class="outline-text-2" id="text-org1f3faf2">
</div>
<div id="outline-container-org77ad72f" class="outline-3">
<h3 id="org77ad72f">Hipotesis [ELM16 22.1.5] [GM09 19.1.3]</h3>
<div class="outline-text-3" id="text-org77ad72f">
<p>
En los siguientes algoritmos de recuperacion de una base de datos ante fallas,
se asume que los solapamientos de transacciones son:
</p>
<ul class="org-ul">
<li>Recuperables</li>
<li>Evitan rollbacks en cascada</li>
</ul>

<p>
Si esta hipotesis no se cumpliera los algoritmos deberan realizar algunos pasos
adicionales que no describiremos. En particular, utilizar los registros de
lectura (READ, T_i, X, v) del log.
</p>
</div>
</div>

<div id="outline-container-org5406eef" class="outline-3">
<h3 id="org5406eef">Algoritmo UNDO (Immediate update)</h3>
<div class="outline-text-3" id="text-org5406eef">
</div>
<div id="outline-container-orgf48a8db" class="outline-4">
<h4 id="orgf48a8db">Regla</h4>
<div class="outline-text-4" id="text-orgf48a8db">
<p>
Todo valor v<sub>old</sub> asignado por una transacción que ya commiteó debe ser
salvaguardado en el log en disco antes de que su modificación por parte de
otra transacción sea guardada en disco (flushed).
</p>
</div>
</div>

<div id="outline-container-orgb03658a" class="outline-4">
<h4 id="orgb03658a">Procedimiento [GM09 17.2.2]</h4>
<div class="outline-text-4" id="text-orgb03658a">
<p>
Para cumplir con la regla se utiliza el siguiente procedimiento:
</p>
<ol class="org-ol">
<li>Cuando una transacción Ti modifica el ítem X remplazando un valor v<sub>old</sub>
por v, se escribe (WRITE,Ti,X,vold) en el log, y se hace flush del log a
disco.</li>
<li>El registro (WRITE,Ti,X,vold) debe ser escrito en el log en
disco(flushed) antes de escribir (flush) el nuevo valor de X en disco
(WAL).</li>
<li>Todo ítem modificado debe ser guardado en disco antes de hacer commit.</li>
<li>Cuando Ti hace commit, se escribe (COMMIT,Ti) en el log y se hace flush
del log a disco (FLC).</li>
</ol>
</div>
</div>

<div id="outline-container-orgd916bef" class="outline-4">
<h4 id="orgd916bef">Observaciones</h4>
<div class="outline-text-4" id="text-orgd916bef">
<p>
Los tres primeros puntos aseguran que todas las modificaciones realizadas
sean escritas a disco antes de que la transacción termine.
</p>

<p>
De esta forma, una vez cumplimentado el paso 4, ya nunca será necesario
hacer REDO. Si la transacción falla antes ó durante el punto 4, será
deshecha (UNDO) al reiniciar.
</p>

<p>
Se considera que la transacción commiteó cuando el registro (COMMIT,Ti)
queda escrito en el log, en disco.
</p>
</div>
</div>

<div id="outline-container-orga1ba621" class="outline-4">
<h4 id="orga1ba621">Reinicio [GM09 17.2.3]</h4>
<div class="outline-text-4" id="text-orga1ba621">
<p>
Cuando el sistema reinicia se siguen los siguientes pasos:
</p>
<ol class="org-ol">
<li>Se recorre el log de adelante hacia atras, y por cada transaccion de la
que no se encuentra el COMMIT, se aplica cada uno de los WRITE para
restaurar el valor anterior a la misma en disco.</li>
<li>Luego, por cada transaccion de la que no se encontro el COMMIT se escribe
(ABORT, T) en el log y se hace flush del log a disco.</li>
</ol>

<p>
Observece que tambien podria ocurrir una falla durante el reinicio. Esto no
es un problema porque el procedimiento de reinicio es <code>idempotente</code>: si se
ejecuta mas de una vez, no cambiaria el resultado.
</p>
</div>
</div>
