org/bdd/13_recuperacion.org
**** 2
     ¿Hasta qué momento pueden guardarse los datos modificados por T1 en disco?

     #+BEGIN_SRC
Todo ítem modificado debe ser guardado en disco antes de hacer commit.
     #+END_SRC

     T1 sólo modifica B. B debe ser guardado en disco antes del commit de T1, es
     decir, antes de escribir (COMMIT,T1) en el log en disco.

**** 3

     ¿Cómo reacciona el sistema ante una falla inmediatamente después del commit de
     T1?

     | WRITE T2 C 38 |
     | WRITE T2 A 60 |
     | ABORT T2      |
     | ABORT T3      |

     Cuando el sistema reinicie, será necesario deshacer (UNDO) T2 y T3,que quedarán
     abortadas. Para ello se deberá escribir 38 en el ítem C y 60 en el ítem A en
     disco. Luego se escribe en el log (ABORT,T2) y (ABORT,T3) y se hace flush del
     log a disco.

** Algoritmo REDO (Deferred update)
*** Regla
    Antes de realizar el commit, todo nuevo valor v asignado por la transaccion debe
    ser salvaguardado en el log, en disco.


    ¿Ésto me obliga a guardar el ítem modificado en disco antes de commitear la
    transacción que lo modificó?

    No, sólo el registro de log! De hecho, en el algoritmo REDO el ítem es
    actualizado en disco luego de commitear la transacción.
*** Procedimiento
    1. Cuando una transaccion T_{i} modifica el item X remplazando un valor v_{old}
       por v, se escribe (WRITE, T_{i}, X, v) en el log.
    2. Cuando T_{i} hace commit, se escribe (COMMIT, T_{i}) en el log y se hace
       flush del log a disco (FLC). Recien entonces se escribe el nuevo valor en
       disco.

    Si la transaccion falla antes del commit, no sera necesario deshacer nada (al
    reiniciar se abortaran las transacciones no commiteadas). Si en cambio falla
    despues de haber escrito el COMMIT en disco, la transaccion sera rehecha al
    iniciar.

    #+BEGIN_SRC
Nuevamente, se considera que la transaccion commiteo cuando el registro (COMMIT,
T_{i}) queda escrito en el log, en disco.
    #+END_SRC

*** Observaciones
    En el algoritmo REDO, una transaccion puede committear sin haber guardado en
    disco todos sus items modificados.

    Ante una falla previa posterior al commit, entonces, sera necesario reescribir
    (REDO) todos los valores que la transaccion habia asignado a los items.

    Esto implicaria recorrer todo el log de atras para adelante aplicando cada uno
    de los WRITE.

    Dado el alto costo de la operacion, el algoritmo REDO va acompañado de ~puntos
    de control (checkpoints)~ en el archivo de log, que evita tener que reejecutar
    todo desde el inicio del archivo.
*** Reinicio
    1. Se analiza cuales son las transacciones de las que esta registrado el COMMIT.
    2. Se recorre el log de atrás hacia adelante volviendo a aplicar cada uno de los
       WRITE de las transacciones que commitearon, para asegurar que quede
       actualizado el valor de cada item.
    3. Luego, por cada transaccion de la que no se encontro el COMMIT se escribe
       (ABORT, T) en el log y se hace flush del log a disco.
*** Ejemplo

    Considere el siguiente solapamiento de transacciones.

    Suponga que los valores iniciales de los ítems son A=60, B=44, C=38.

    | Transacción T1   | Transacción T2   | Transacción T3   |
    | begin            |                  |                  |
    | leer_item(B)     |                  |                  |
    | B=B+4            |                  |                  |
    | escribir_item(B) |                  |                  |
    |                  | begin            |                  |
    |                  | leer_item(A)     |                  |
    |                  | leer_item(C)     |                  |
    |                  | A=A÷2            |                  |
    |                  | C=C+10           |                  |
    |                  | escribir_item(A) |                  |
    |                  | escribir_item(C) |                  |
    |                  |                  | begin            |
    | commit           |                  |                  |
    |                  |                  | leer_item(B)     |
    |                  |                  | B=B+5            |
    |                  |                  | escribir_item(B) |
    |                  | commit           |                  |
    |                  |                  | leer_item(A)     |
    |                  |                  | A=A×1,10         |
    |                  |                  | escribir_item(A) |
    |                  |                  | commit           |
*** Ejercicios
