bdd/13_recuperacion.html

<div id="outline-container-orgf99ecb5" class="outline-4">
<h4 id="orgf99ecb5">Ejemplo</h4>
<div class="outline-text-4" id="text-orgf99ecb5">
<p>
Considere el siguiente solapamiento de transacciones.
</p>

<p>
Suponga que los valores iniciales de los ítems son A=60,B=44,C=38.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Transacción T1</td>
<td class="org-left">Transacción T2</td>
<td class="org-left">Transacción T3</td>
</tr>

<tr>
<td class="org-left">begin</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">leer_item(B)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">B=B+4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">escribir_item(B)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">begin</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(A)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(C)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">A=A÷2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C=C+10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(A)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(C)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">begin</td>
</tr>

<tr>
<td class="org-left">commit</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(B)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">B=B+5</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(B)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">commit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(A)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">A=A×1,10</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(A)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">commit</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgcb04e4f" class="outline-4">
<h4 id="orgcb04e4f">Ejercicios</h4>
<div class="outline-text-4" id="text-orgcb04e4f">
</div>
<div id="outline-container-org1010326" class="outline-5">
<h5 id="org1010326">1</h5>
<div class="outline-text-5" id="text-org1010326">
<p>
Escriba la secuencia de registros de un log UNDO (omita los registros de
lectura).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">BEGIN T1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">WRITE T1 B 44</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">BEGIN T2</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">WRITE T2 A 60</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">WRITE T2 C 38</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">BEGIN T3</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">COMMIT T1</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">WRITE T2 B 48</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">COMMIT T2</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">WRITE T3 A 30</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">COMMIT T3</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf4cbeb8" class="outline-5">
<h5 id="orgf4cbeb8">2</h5>
<div class="outline-text-5" id="text-orgf4cbeb8">
<p>
¿Hasta qué momento pueden guardarse los datos modificados por T1 en disco?
</p>

<pre class="example">
Todo ítem modificado debe ser guardado en disco antes de hacer commit.
</pre>

<p>
T1 sólo modifica B. B debe ser guardado en disco antes del commit de T1, es
decir, antes de escribir (COMMIT,T1) en el log en disco.
</p>
</div>
</div>

<div id="outline-container-orgf4390ca" class="outline-5">
<h5 id="orgf4390ca">3</h5>
<div class="outline-text-5" id="text-orgf4390ca">
<p>
¿Cómo reacciona el sistema ante una falla inmediatamente después del commit de
T1?
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">WRITE T2 C 38</td>
</tr>

<tr>
<td class="org-left">WRITE T2 A 60</td>
</tr>

<tr>
<td class="org-left">ABORT T2</td>
</tr>

<tr>
<td class="org-left">ABORT T3</td>
</tr>
</tbody>
</table>

<p>
Cuando el sistema reinicie, será necesario deshacer (UNDO) T2 y T3,que quedarán
abortadas. Para ello se deberá escribir 38 en el ítem C y 60 en el ítem A en
disco. Luego se escribe en el log (ABORT,T2) y (ABORT,T3) y se hace flush del
log a disco.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org9cfbc7f" class="outline-3">
<h3 id="org9cfbc7f">Algoritmo REDO (Deferred update)</h3>
<div class="outline-text-3" id="text-org9cfbc7f">
</div>
<div id="outline-container-org74969c9" class="outline-4">
<h4 id="org74969c9">Regla</h4>
<div class="outline-text-4" id="text-org74969c9">
<p>
Antes de realizar el commit, todo nuevo valor v asignado por la transaccion debe
ser salvaguardado en el log, en disco.
</p>


<p>
¿Ésto me obliga a guardar el ítem modificado en disco antes de commitear la
transacción que lo modificó?
</p>

<p>
No, sólo el registro de log! De hecho, en el algoritmo REDO el ítem es
actualizado en disco luego de commitear la transacción.
</p>
</div>
</div>
<div id="outline-container-orga7c46d3" class="outline-4">
<h4 id="orga7c46d3">Procedimiento</h4>
<div class="outline-text-4" id="text-orga7c46d3">
<ol class="org-ol">
<li>Cuando una transaccion T<sub>i</sub> modifica el item X remplazando un valor v<sub>old</sub>
por v, se escribe (WRITE, T<sub>i</sub>, X, v) en el log.</li>
<li>Cuando T<sub>i</sub> hace commit, se escribe (COMMIT, T<sub>i</sub>) en el log y se hace
flush del log a disco (FLC). Recien entonces se escribe el nuevo valor en
disco.</li>
</ol>

<p>
Si la transaccion falla antes del commit, no sera necesario deshacer nada (al
reiniciar se abortaran las transacciones no commiteadas). Si en cambio falla
despues de haber escrito el COMMIT en disco, la transaccion sera rehecha al
iniciar.
</p>

<pre class="example">
Nuevamente, se considera que la transaccion commiteo cuando el registro (COMMIT,
T_{i}) queda escrito en el log, en disco.
</pre>
</div>
</div>

<div id="outline-container-orgbbd69d6" class="outline-4">
<h4 id="orgbbd69d6">Observaciones</h4>
<div class="outline-text-4" id="text-orgbbd69d6">
<p>
En el algoritmo REDO, una transaccion puede committear sin haber guardado en
disco todos sus items modificados.
</p>

<p>
Ante una falla previa posterior al commit, entonces, sera necesario reescribir
(REDO) todos los valores que la transaccion habia asignado a los items.
</p>

<p>
Esto implicaria recorrer todo el log de atras para adelante aplicando cada uno
de los WRITE.
</p>

<p>
Dado el alto costo de la operacion, el algoritmo REDO va acompañado de <code>puntos
    de control (checkpoints)</code> en el archivo de log, que evita tener que reejecutar
todo desde el inicio del archivo.
</p>
</div>
</div>
<div id="outline-container-org867ec26" class="outline-4">
<h4 id="org867ec26">Reinicio</h4>
<div class="outline-text-4" id="text-org867ec26">
<ol class="org-ol">
<li>Se analiza cuales son las transacciones de las que esta registrado el COMMIT.</li>
<li>Se recorre el log de atrás hacia adelante volviendo a aplicar cada uno de los
WRITE de las transacciones que commitearon, para asegurar que quede
actualizado el valor de cada item.</li>
<li>Luego, por cada transaccion de la que no se encontro el COMMIT se escribe
(ABORT, T) en el log y se hace flush del log a disco.</li>
</ol>
</div>
</div>
