org/bdd/13_recuperacion.org
**** 1
     Escriba la secuencia de registros de un log REDO para el mismo ejercicio
     considerado anteriormente (omita los registros de lectura).

     |  1 | BEGIN T1      |
     |  2 | WRITE T1 B 48 |
     |  3 | BEGIN T2      |
     |  4 | WRITE T2 A 30 |
     |  5 | WRITE T2 C 48 |
     |  6 | BEGIN T3      |
     |  7 | COMMIT T1     |
     |  8 | WRITE T3 B 53 |
     |  9 | COMMIT T2     |
     | 10 | WRITE T3 A 33 |
     | 11 | COMMIT T3     |

**** 2
     ¿Cómo reacciona el sistema ante una falla después del commit de T1?

     Solo committeo T1, por lo que solo se rehace T1 en disco.

     WRITE T1 B 48

     Las demas transacciones se abortan y se lo refleja en el log

     ABORT T2
     ABORT T3

     Flush del log a disco.

** Algoritmo UNDO/REDO [GM09 17.4.1]
   Es necesario cumplir con abmas reglas a la vez
*** Procedimiento
    1. Cuando una transaccion Ti modifica el item X remplazando un valor v_{old} por
       v, se escribe (WRITE Ti X v_{old} v) en el log.
    2. El registro (WRITE Ti X v_{old} v) debe ser escrito en el log en disco
       (flushed) antes de escribir (flush) el nuevo valor de X en disco.
    3. Cuando Ti hace commit, se escribe (COMMIT Ti) en el log y se hace flush del
       log a disco.
    4. Los items modificados pueden ser guardados en disco antes o despues de hacer
       commit.

*** Reinicio [GM09 17.4.2]
    1. Se recorre el log de adelante hacia atras, y por cada transaccion de la que
       no se encuentra COMMIT se aplica cada uno de los WRITE para restaurar el
       _valor anterior_ a la misma en disco.
    2. Luego se recorre de atras hacia adelante volviendo a aplicar cada uno de los
       WRITE de las transacciones que committearon, para asegurar que quede asignado
       el _nuevo valor_ de cada item.
    3. Finalmente, por cada transaccion de la que no se encontro el COMMIT se
       escribe (ABORT T) en el log y se hace flush del log a disco.

*** Ejercicios
**** 1
     Para la siguiente secuencia de registros de log, indique qué items
     deben/pueden haber cambiado su valor en disco. Luego aplique el algoritmo
     de recuperación UNDO/REDO e indique cómo queda el archivo de log.

     | 1 | (BEGIN, T1)            |
     | 2 | (WRITE, T1, A, 10, 15) |
     | 3 | (BEGIN, T2)            |
     | 4 | (WRITE, T2, B, 30, 25) |
     | 5 | (WRITE, T1, C, 35, 32) |
     | 6 | (WRITE, T2, D, 14, 12) |
     | 7 | (COMMIT, T2)           |

     Los items A,B,C,D pueden haber cambiado sus valores en disco pero no
     necesariamente

     | UNDO  | (WRITE, T1, C, 32, 35) |
     |       | (WRITE, T1, A, 15, 10) |
     |-------+------------------------|
     | REDO  | (WRITE, T2, B, 30, 25) |
     |       | (WRITE, T2, D, 14, 12) |
     |-------+------------------------|
     | ABORT | (ABORT T1)             |

     Flush

* Puntos de control

  Cuando reiniciamos el sistema no sabemos hasta donde tenemos que retroceder en
  el archivo de log. Aunque muchas transacciones antiguas ya commiteadas
  seguramente tendran sus datos guardados ya en disco.

  Para evitar este retroceso hasta el inicio del sistema y el crecimiento
  ilimitado de los archivos de log, se utilizan ~puntos de control (checkpoints)~

  Un punto de control es un registro especial en el archivo de log que indica que
  todos los items modificados hasta este punto han sido almacenados en disco.

  La presencia de un checkpoint en el log implica que todas las transacciones cuyo
  registro de commit aparece con anterioridad tienen todos sus items guardados en
  forma persistente, y por lo tanto ya no deberan ser deshechas ni rehechas.

** Checkpoints activos e inactivos

   Los ~checkpoints inactivos~ tienen un unico tipo de registro: ~CKPT~

   La creacion de un checkpoint inactivo en el log implica la suspension momentanea
   de todas las transaccion para hacer el volcado de todos los buffers en memoria
   al disco.

   Para aminorar la perdida de tiempo de ejecucion en el volcado a disco puede
   utilizarse una tecnica conocida como ~checkpointing activo~, que utiliza dos
   tipos de registros: ~(BEGIN CKPT t_{act})~ y ~(END CKPT)~, en donde t_{act} es
   un listado de todas las transacciones que se encuentran activas (es decir, que
   no hicieron commit). El procedimiento varia segun cada algoritmo de
   recuperacion.

** Algoritmo UNDO
