bdd/13_recuperacion.html
<div id="outline-container-org9bc8335" class="outline-4">
<h4 id="org9bc8335">Ejemplo</h4>
<div class="outline-text-4" id="text-org9bc8335">
<p>
Considere el siguiente solapamiento de transacciones.
</p>

<p>
Suponga que los valores iniciales de los ítems son A=60, B=44, C=38.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Transacción T1</td>
<td class="org-left">Transacción T2</td>
<td class="org-left">Transacción T3</td>
</tr>

<tr>
<td class="org-left">begin</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">leer_item(B)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">B=B+4</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">escribir_item(B)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">begin</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(A)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(C)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">A=A÷2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">C=C+10</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(A)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(C)</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">begin</td>
</tr>

<tr>
<td class="org-left">commit</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(B)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">B=B+5</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(B)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">commit</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">leer_item(A)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">A=A×1,10</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">escribir_item(A)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">commit</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org93cffe2" class="outline-4">
<h4 id="org93cffe2">Ejercicios</h4>
<div class="outline-text-4" id="text-org93cffe2">
</div>
<div id="outline-container-org0b9cd08" class="outline-5">
<h5 id="org0b9cd08">1</h5>
<div class="outline-text-5" id="text-org0b9cd08">
<p>
Escriba la secuencia de registros de un log REDO para el mismo ejercicio
considerado anteriormente (omita los registros de lectura).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">BEGIN T1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">WRITE T1 B 48</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">BEGIN T2</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">WRITE T2 A 30</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">WRITE T2 C 48</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">BEGIN T3</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">COMMIT T1</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">WRITE T3 B 53</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">COMMIT T2</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">WRITE T3 A 33</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">COMMIT T3</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3433fda" class="outline-5">
<h5 id="org3433fda">2</h5>
<div class="outline-text-5" id="text-org3433fda">
<p>
¿Cómo reacciona el sistema ante una falla después del commit de T1?
</p>

<p>
Solo committeo T1, por lo que solo se rehace T1 en disco.
</p>

<p>
WRITE T1 B 48
</p>

<p>
Las demas transacciones se abortan y se lo refleja en el log
</p>

<p>
ABORT T2
ABORT T3
</p>

<p>
Flush del log a disco.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd0336f4" class="outline-3">
<h3 id="orgd0336f4">Algoritmo UNDO/REDO [GM09 17.4.1]</h3>
<div class="outline-text-3" id="text-orgd0336f4">
<p>
Es necesario cumplir con abmas reglas a la vez
</p>
</div>
<div id="outline-container-org6502ef0" class="outline-4">
<h4 id="org6502ef0">Procedimiento</h4>
<div class="outline-text-4" id="text-org6502ef0">
<ol class="org-ol">
<li>Cuando una transaccion Ti modifica el item X remplazando un valor v<sub>old</sub> por
v, se escribe (WRITE Ti X v<sub>old</sub> v) en el log.</li>
<li>El registro (WRITE Ti X v<sub>old</sub> v) debe ser escrito en el log en disco
(flushed) antes de escribir (flush) el nuevo valor de X en disco.</li>
<li>Cuando Ti hace commit, se escribe (COMMIT Ti) en el log y se hace flush del
log a disco.</li>
<li>Los items modificados pueden ser guardados en disco antes o despues de hacer
commit.</li>
</ol>
</div>
</div>

<div id="outline-container-org0540faa" class="outline-4">
<h4 id="org0540faa">Reinicio [GM09 17.4.2]</h4>
<div class="outline-text-4" id="text-org0540faa">
<ol class="org-ol">
<li>Se recorre el log de adelante hacia atras, y por cada transaccion de la que
no se encuentra COMMIT se aplica cada uno de los WRITE para restaurar el
<span class="underline">valor anterior</span> a la misma en disco.</li>
<li>Luego se recorre de atras hacia adelante volviendo a aplicar cada uno de los
WRITE de las transacciones que committearon, para asegurar que quede asignado
el <span class="underline">nuevo valor</span> de cada item.</li>
<li>Finalmente, por cada transaccion de la que no se encontro el COMMIT se
escribe (ABORT T) en el log y se hace flush del log a disco.</li>
</ol>
</div>
</div>

<div id="outline-container-orgb897b02" class="outline-4">
<h4 id="orgb897b02">Ejercicios</h4>
<div class="outline-text-4" id="text-orgb897b02">
</div>
<div id="outline-container-orgbd15544" class="outline-5">
<h5 id="orgbd15544">1</h5>
<div class="outline-text-5" id="text-orgbd15544">
<p>
Para la siguiente secuencia de registros de log, indique qué items
deben/pueden haber cambiado su valor en disco. Luego aplique el algoritmo
de recuperación UNDO/REDO e indique cómo queda el archivo de log.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">(BEGIN, T1)</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">(WRITE, T1, A, 10, 15)</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">(BEGIN, T2)</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">(WRITE, T2, B, 30, 25)</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">(WRITE, T1, C, 35, 32)</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">(WRITE, T2, D, 14, 12)</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">(COMMIT, T2)</td>
</tr>
</tbody>
</table>

<p>
Los items A,B,C,D pueden haber cambiado sus valores en disco pero no
necesariamente
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">UNDO</th>
<th scope="col" class="org-left">(WRITE, T1, C, 32, 35)</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">(WRITE, T1, A, 15, 10)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">REDO</td>
<td class="org-left">(WRITE, T2, B, 30, 25)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">(WRITE, T2, D, 14, 12)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">ABORT</td>
<td class="org-left">(ABORT T1)</td>
</tr>
</tbody>
</table>

<p>
Flush
</p>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org6b21d84" class="outline-2">
<h2 id="org6b21d84">Puntos de control</h2>
<div class="outline-text-2" id="text-org6b21d84">
<p>
Cuando reiniciamos el sistema no sabemos hasta donde tenemos que retroceder en
el archivo de log. Aunque muchas transacciones antiguas ya commiteadas
seguramente tendran sus datos guardados ya en disco.
</p>

<p>
Para evitar este retroceso hasta el inicio del sistema y el crecimiento
ilimitado de los archivos de log, se utilizan <code>puntos de control (checkpoints)</code>
</p>

<p>
Un punto de control es un registro especial en el archivo de log que indica que
todos los items modificados hasta este punto han sido almacenados en disco.
</p>

<p>
La presencia de un checkpoint en el log implica que todas las transacciones cuyo
registro de commit aparece con anterioridad tienen todos sus items guardados en
forma persistente, y por lo tanto ya no deberan ser deshechas ni rehechas.
</p>
</div>

<div id="outline-container-org56e43b7" class="outline-3">
<h3 id="org56e43b7">Checkpoints activos e inactivos</h3>
<div class="outline-text-3" id="text-org56e43b7">
<p>
Los <code>checkpoints inactivos</code> tienen un unico tipo de registro: <code>CKPT</code>
</p>

<p>
La creacion de un checkpoint inactivo en el log implica la suspension momentanea
de todas las transaccion para hacer el volcado de todos los buffers en memoria
al disco.
</p>

<p>
Para aminorar la perdida de tiempo de ejecucion en el volcado a disco puede
utilizarse una tecnica conocida como <code>checkpointing activo</code>, que utiliza dos
tipos de registros: <code>(BEGIN CKPT t_{act})</code> y <code>(END CKPT)</code>, en donde t<sub>act</sub> es
un listado de todas las transacciones que se encuentran activas (es decir, que
no hicieron commit). El procedimiento varia segun cada algoritmo de
recuperacion.
</p>
</div>
</div>
