org/bdd/13_recuperacion.org
*** Checkpoint Inactivo [GM09 17.2.4]
    Procedimiento:
    1. Dejar de aceptar nuevas transacciones
    2. Esperar a que todas las transacciones hagan su commit (es decir, escriban su
       registro de COMMIT en el log y lo vuelquen a disco).
    3. Escribir (CKPT) en el log y volcarlo a disco.

    Si el sistema cae justo después de escribir (CKPT) en el log, ¿es posible que
    alguno de los ítems modificados por alguna transacción no hayan sido guardados a
    disco?
    - No, porque en el algoritmo UNDO la presencia del registro de COMMIT en el log
      implica que todos los ítems fueron ya salvaguardados en disco.

    Durante la recuperación, sólo debemos deshacer las transacciones que no hayan
    hecho commit, hasta el momento en que encontremos un registro de tipo (CKPT). De
    hecho, todo el archivo de log anterior al checkpoint podía ser eliminado.

*** Checkpoint Activo [GM09 17.2.5]
    Procedimiento:
    1. Escribir un registro (BEGIN CKPT, t_{act}) con el listado de todas las
       transacciones activas hasta el momento.
    2. Esperar a que todas esas transacciones activas hagan su commit (sin deja por
       eso de recibir nuevas transacciones)
    3. Escribir (END CKPT) en el log y volcarlo a disco.

    En la recuperación, al hacer el rollback se dan dos situaciones:
    - Que encontremos primero un registro (END CKPT). En ese caso, solo debemos
      retroceder hasta el (BEGIN CKPT) durante el rollback, porque ninguna
      transaccion incompleta puede haber comenzado antes.
    - Que encontremos primero un registro (BEGIN CKPT). Esto implica que el sistema
      cayó sin asegurar los commits del listado de transacciones. Deberemos volver
      hacia atras, pero solo hasta el inicio de la transaccion más antigua del
      listado.

**** Ejemplo

     Considere la siguiente secuencia de registros de un log UNDO con checkpointing
     activo. El sistema falla después de loguear el último de ellos en disco.

     | 01 | (BEGIN, T_{1})             |
     | 02 | (WRITE, T_{1}, X, 50)      |
     | 03 | (BEGIN, T_{2})             |
     | 04 | (WRITE, T_{1}, Y, 15)      |
     | 05 | (WRITE, T_{2}, X, 8)       |
     | 06 | (BEGIN, T_{3})             |
     | 07 | (WRITE, T_{3}, Z, 3)       |
     | 08 | (COMMIT, T_{1})            |
     | 09 | (BEGIN CKPT, T_{2}, T_{3}) |
     | 10 | (WRITE, T_{2}, X, 7)       |
     | 11 | (WRITE, T_{3}, Y, 4)       |

     1. Hasta que linea sera necesario volver atras?
        1. Hasta la linea 03
     2. Indique como sera el procedimiento de recuperacion.
        - En disco, escrbir:
          | (WRITE, T_{3}, Y, 4) |
          | (WRITE, T_{2}, X, 7) |
          | (WRITE, T_{3}, Z, 3) |
          | (WRITE, T_{2}, X, 8) |
        - En el log, escrbir:
          | (ABORT, T2) |
          | (ABORT, T3) |
          y flushear.

** Algoritmo REDO
*** Checkpoint Activo [GM09 17.3.3 17.3.4]
    Procedimiento:
    1. Escribir un registro (BEGIN CKPT, t_{act}) con el listado de todas las
       transacciones activas hasta el momento y volcar el log a disco.
    2. Hacer el volcado a disco de todos los items que hayan sido modificados por
       transacciones que ya commitearon.
    3. Escribir (END CKPT) en el log y volcarlo a disco.

    Recuperacion:
    - Que encontremos primero un registro (END CKPT). En ese caso, deberemos
      retroceder hasta el (BEGIN T_{x}) mas antiguo del listado que figure en el
      (BEGIN CKPT) para rehacer todas las transacciones que
      commitearon. Escribir (ABORT T_{y}) para aquellas que no hayan commiteado.
    - Que encontremos primero un registro (BEGIN CKPT). Si el checkpoint llego
      solo hasta este punto no nos sirve, y entonces deberemos ir a buscar un
      checkpoint anterior en el log.

