bdd/13_recuperacion.html

<div id="outline-container-orge6c66fa" class="outline-3">
<h3 id="orge6c66fa">Algoritmo UNDO</h3>
<div class="outline-text-3" id="text-orge6c66fa">
</div>
<div id="outline-container-org1d63d66" class="outline-4">
<h4 id="org1d63d66">Checkpoint Inactivo [GM09 17.2.4]</h4>
<div class="outline-text-4" id="text-org1d63d66">
<p>
Procedimiento:
</p>
<ol class="org-ol">
<li>Dejar de aceptar nuevas transacciones</li>
<li>Esperar a que todas las transacciones hagan su commit (es decir, escriban su
registro de COMMIT en el log y lo vuelquen a disco).</li>
<li>Escribir (CKPT) en el log y volcarlo a disco.</li>
</ol>

<p>
Si el sistema cae justo después de escribir (CKPT) en el log, ¿es posible que
alguno de los ítems modificados por alguna transacción no hayan sido guardados a
disco?
</p>
<ul class="org-ul">
<li>No, porque en el algoritmo UNDO la presencia del registro de COMMIT en el log
implica que todos los ítems fueron ya salvaguardados en disco.</li>
</ul>

<p>
Durante la recuperación, sólo debemos deshacer las transacciones que no hayan
hecho commit, hasta el momento en que encontremos un registro de tipo (CKPT). De
hecho, todo el archivo de log anterior al checkpoint podía ser eliminado.
</p>
</div>
</div>

<div id="outline-container-org13423bb" class="outline-4">
<h4 id="org13423bb">Checkpoint Activo [GM09 17.2.5]</h4>
<div class="outline-text-4" id="text-org13423bb">
<p>
Procedimiento:
</p>
<ol class="org-ol">
<li>Escribir un registro (BEGIN CKPT, t<sub>act</sub>) con el listado de todas las
transacciones activas hasta el momento.</li>
<li>Esperar a que todas esas transacciones activas hagan su commit (sin deja por
eso de recibir nuevas transacciones)</li>
<li>Escribir (END CKPT) en el log y volcarlo a disco.</li>
</ol>

<p>
En la recuperación, al hacer el rollback se dan dos situaciones:
</p>
<ul class="org-ul">
<li>Que encontremos primero un registro (END CKPT). En ese caso, solo debemos
retroceder hasta el (BEGIN CKPT) durante el rollback, porque ninguna
transaccion incompleta puede haber comenzado antes.</li>
<li>Que encontremos primero un registro (BEGIN CKPT). Esto implica que el sistema
cayó sin asegurar los commits del listado de transacciones. Deberemos volver
hacia atras, pero solo hasta el inicio de la transaccion más antigua del
listado.</li>
</ul>
</div>

<div id="outline-container-org656dae6" class="outline-5">
<h5 id="org656dae6">Ejemplo</h5>
<div class="outline-text-5" id="text-org656dae6">
<p>
Considere la siguiente secuencia de registros de un log UNDO con checkpointing
activo. El sistema falla después de loguear el último de ellos en disco.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">01</td>
<td class="org-left">(BEGIN, T<sub>1</sub>)</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">(WRITE, T<sub>1</sub>, X, 50)</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">(BEGIN, T<sub>2</sub>)</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">(WRITE, T<sub>1</sub>, Y, 15)</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">(WRITE, T<sub>2</sub>, X, 8)</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">(BEGIN, T<sub>3</sub>)</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">(WRITE, T<sub>3</sub>, Z, 3)</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">(COMMIT, T<sub>1</sub>)</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">(BEGIN CKPT, T<sub>2</sub>, T<sub>3</sub>)</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">(WRITE, T<sub>2</sub>, X, 7)</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">(WRITE, T<sub>3</sub>, Y, 4)</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>Hasta que linea sera necesario volver atras?
<ol class="org-ol">
<li>Hasta la linea 03</li>
</ol></li>
<li>Indique como sera el procedimiento de recuperacion.
<ul class="org-ul">
<li><p>
En disco, escrbir:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(WRITE, T<sub>3</sub>, Y, 4)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T<sub>2</sub>, X, 7)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T<sub>3</sub>, Z, 3)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T<sub>2</sub>, X, 8)</td>
</tr>
</tbody>
</table></li>
<li><p>
En el log, escrbir:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(ABORT, T2)</td>
</tr>

<tr>
<td class="org-left">(ABORT, T3)</td>
</tr>
</tbody>
</table>
<p>
y flushear.
</p></li>
</ul></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org4575a01" class="outline-3">
<h3 id="org4575a01">Algoritmo REDO</h3>
<div class="outline-text-3" id="text-org4575a01">
</div>
<div id="outline-container-org9d57206" class="outline-4">
<h4 id="org9d57206">Checkpoint Activo [GM09 17.3.3 17.3.4]</h4>
<div class="outline-text-4" id="text-org9d57206">
<p>
Procedimiento:
</p>
<ol class="org-ol">
<li>Escribir un registro (BEGIN CKPT, t<sub>act</sub>) con el listado de todas las
transacciones activas hasta el momento y volcar el log a disco.</li>
<li>Hacer el volcado a disco de todos los items que hayan sido modificados por
transacciones que ya commitearon.</li>
<li>Escribir (END CKPT) en el log y volcarlo a disco.</li>
</ol>

<p>
Recuperacion:
</p>
<ul class="org-ul">
<li>Que encontremos primero un registro (END CKPT). En ese caso, deberemos
retroceder hasta el (BEGIN T<sub>x</sub>) mas antiguo del listado que figure en el
(BEGIN CKPT) para rehacer todas las transacciones que
commitearon. Escribir (ABORT T<sub>y</sub>) para aquellas que no hayan commiteado.</li>
<li>Que encontremos primero un registro (BEGIN CKPT). Si el checkpoint llego
solo hasta este punto no nos sirve, y entonces deberemos ir a buscar un
checkpoint anterior en el log.</li>
</ul>
</div>
