bdd/13_recuperacion.html

<div id="outline-container-org6df774f" class="outline-5">
<h5 id="org6df774f">Ejemplo</h5>
<div class="outline-text-5" id="text-org6df774f">
<p>
Considere la siguiente secuencia de registros de un log REDO con
checkpointing activo. El sistema falla después de loguear el último de
ellos en disco.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">01</td>
<td class="org-left">(BEGIN, T1)</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">(WRITE, T1, A, 10)</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">(BEGIN, T2)</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">(WRITE, T2, B, 5)</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">(WRITE, T1, C, 7)</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">(BEGIN, T3)</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">(WRITE, T3, D, 8)</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">(COMMIT, T1)</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">(BEGIN CKPT, &#x2026;.)</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">(BEGIN, T4)</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">(WRITE, T2, E, 5)</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">(COMMIT, T2)</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">(WRITE, T3, F, 7)</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">(WRITE, T4, G, 15)</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">(END CKPT)</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">(COMMIT, T3)</td>
</tr>

<tr>
<td class="org-right">17</td>
<td class="org-left">(BEGIN, T5)</td>
</tr>

<tr>
<td class="org-right">18</td>
<td class="org-left">(WRITE, T5, H, 20)</td>
</tr>

<tr>
<td class="org-right">19</td>
<td class="org-left">(BEGIN CKPT, &#x2026;.)</td>
</tr>

<tr>
<td class="org-right">20</td>
<td class="org-left">(COMMIT, T5)</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li><p>
Complete los listados de transacciones en los (BEGIN CKPT)
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(BEGIN, T1)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T1, A, 10)</td>
</tr>

<tr>
<td class="org-left">(BEGIN, T2)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T2, B, 5)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T1, C, 7)</td>
</tr>

<tr>
<td class="org-left">(BEGIN, T3)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T3, D, 8)</td>
</tr>

<tr>
<td class="org-left">(COMMIT, T1)</td>
</tr>

<tr>
<td class="org-left">(BEGIN CKPT, T2, T3)</td>
</tr>

<tr>
<td class="org-left">(BEGIN, T4)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T2, E, 5)</td>
</tr>

<tr>
<td class="org-left">(COMMIT, T2)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T3, F, 7)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T4, G, 15)</td>
</tr>

<tr>
<td class="org-left">(END CKPT)</td>
</tr>

<tr>
<td class="org-left">(COMMIT, T3)</td>
</tr>

<tr>
<td class="org-left">(BEGIN, T5)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T5, H, 20)</td>
</tr>

<tr>
<td class="org-left">(BEGIN CKPT, T4, T5)</td>
</tr>

<tr>
<td class="org-left">(COMMIT, T5)</td>
</tr>
</tbody>
</table></li>
<li>Hasta que linea sera necesario volver atras?
<ol class="org-ol">
<li>Hasta la linea 03 que es donde empieza T2.</li>
</ol></li>
<li>Indique como sera el procedimiento de recuperacion
<ol class="org-ol">
<li><p>
Rehacer en disco todas las transacciones que ya commitearon
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">(WRITE, T2, B, 5)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T3, D, 8)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T2, E, 5)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T3, F, 7)</td>
</tr>

<tr>
<td class="org-left">(WRITE, T5, H, 20)</td>
</tr>
</tbody>
</table></li>
<li><p>
Abortar en el log las que no y flushear.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">ABORT T4</td>
</tr>
</tbody>
</table></li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org94e1d41" class="outline-3">
<h3 id="org94e1d41">Algoritmo UNDO/REDO</h3>
<div class="outline-text-3" id="text-org94e1d41">
</div>
<div id="outline-container-org28083a7" class="outline-4">
<h4 id="org28083a7">Checkpoint Activo [GM09 17.4.3]</h4>
<div class="outline-text-4" id="text-org28083a7">
<p>
Procedimiento:
</p>
<ol class="org-ol">
<li>Escribir un registro (BEGIN CKPT, t<sub>act</sub>) con el listado de todas las
transacciones activas hasta el momento y volcar el log a disco.</li>
<li>Hacer el volcado a disco de todos los items que hayan sido modificados antes
del (BEGIN CKPT).</li>
<li>Escribir (END CKPT) en el log y volcarlo a disco.</li>
</ol>

<p>
En la recuperacion es posible que debamos retroceder hasta el inicio de la
transaccion mas antigua en el listado de transacciones, para deshacerla en caso
que no haya commiteado.
</p>
</div>

<div id="outline-container-orgd59dcb7" class="outline-5">
<h5 id="orgd59dcb7">Ejemplo</h5>
<div class="outline-text-5" id="text-orgd59dcb7">
<p>
Considere la siguiente secuencia de registros de un log UNDO/REDO con
checkpointing activo.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">01</td>
<td class="org-left">(BEGIN, T1)</td>
</tr>

<tr>
<td class="org-right">02</td>
<td class="org-left">(WRITE, T1, A, 60, 61)</td>
</tr>

<tr>
<td class="org-right">03</td>
<td class="org-left">(COMMIT, T1)</td>
</tr>

<tr>
<td class="org-right">04</td>
<td class="org-left">(BEGIN, T2)</td>
</tr>

<tr>
<td class="org-right">05</td>
<td class="org-left">(WRITE, T2, A, 61, 62)</td>
</tr>

<tr>
<td class="org-right">06</td>
<td class="org-left">(BEGIN, T3)</td>
</tr>

<tr>
<td class="org-right">07</td>
<td class="org-left">(WRITE, T3, B, 20, 21)</td>
</tr>

<tr>
<td class="org-right">08</td>
<td class="org-left">(WRITE, T2, C, 30, 31)</td>
</tr>

<tr>
<td class="org-right">09</td>
<td class="org-left">(BEGIN, T4)</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">(WRITE, T3, D, 40, 41)</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">(WRITE, T4, F, 70, 71)</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">(COMMIT, T3)</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">(WRITE, T2, E, 50, 51)</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">(COMMIT, T2)</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">(WRITE, T4, B, 21, 22)</td>
</tr>

<tr>
<td class="org-right">16</td>
<td class="org-left">(COMMIT, T4)</td>
</tr>
</tbody>
</table>

<ol class="org-ol">
<li>Suponga que se agrega un registro (BEGIN CKPT, T1) justo después de la
línea 02. ¿En qué posición del listado podría escribirse el registro (END
CKPT)?
<ol class="org-ol">
<li>El registro (END CKPT) podría escribirse en cualquier posición después del
(BEGIN CKPT, T1), siempre que ya se hayan guardado a disco todos los ítems
modificados con anterioridad al (BEGIN CKPT).</li>
</ol></li>
<li>Con ese checkpoint iniciado, hasta donde deberemos retroceder si se reinicia
el sistema despues de escribir en el log la linea (WRITE, T2, A, 61, 62)?
Describa el procedimiento de reinicio.
<ol class="org-ol">
<li>Deberemos retroceder hasta el (BEGIN, T1). Hay que hacer el UNDO de la
transacción T2 y el REDO de la transacción T1. Debemos entonces
asignar A = 61 en el disco. Luego debemos escribir (ABORT, T2) en el log y
volcarlo a disco.</li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org3db2e9b" class="outline-3">
<h3 id="org3db2e9b">Checkpointing activo</h3>
<div class="outline-text-3" id="text-org3db2e9b">
<p>
En el algoritmo UNDO, escribimos el (END CKPT) cuando todas las transacciones
del listado de transacciones activas hayan hecho commit.
</p>

<p>
Para el algoritmo REDO, escribimos (END CKPT) cuando todos los ítems modificados
por transacciones que ya habían commiteado al momento del (BEGIN CKPT) hayan
sido salvaguardadas en disco.
</p>

<p>
En el UNDO/REDO escribimos (END CKPT) cuando todos los ítems modificados antes
del (BEGIN CKPT) hayan sido guardados en disco.
</p>
</div>
</div>
</div>

<div id="outline-container-org96e303d" class="outline-2">
<h2 id="org96e303d">Bibliografía</h2>
<div class="outline-text-2" id="text-org96e303d">
<ul class="org-ul">
<li>[GM09] Database Systems, The Complete Book, 2nd Edition.H. García-Molina,
J. Ullman, J. Widom, 2009.Capítulo 17. Nuestro desarrollo de esta clase, y en
particular del uso de checkpoints, está basado en este libro.</li>
<li>[ELM16] Fundamentals of Database Systems, 7th Edition.R. Elmasri, S. Navathe,
<ol class="org-ol">
<li>Capítulo 22.</li>
</ol></li>
<li>[CONN15] Database Systems, a Practical Approach to Design,Implementation and
Management, 6th Edition.T. Connolly, C. Begg, 2015. Capítulo 22 (Sección
<ol class="org-ol">
<li>Cubre muy brevemente el tema.</li>
</ol></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-05-01 11:27
</div>
</body>
</html>
